Revit 2027 API
ParameterTypeId.FabricationPartMaterialWeight Property
 "Material Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartMaterialWeight { get; }
Public Shared ReadOnly Property FabricationPartMaterialWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartMaterialWeight {
	ForgeTypeId^ get ();
}
static member FabricationPartMaterialWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace